In [1]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame([[3,5],[7,6]])
df

   0  1
0  3  5
1  7  6

In [4]:
df = pd.DataFrame(np.random.randint(1,50,25).reshape(5,5))
df

    0   1   2   3   4
0  45   5   7  35  31
1  19  44  33  47  30
2  32  25  26  46  33
3  45  45   1  21  49
4  47   5  28   8  30

In [5]:
df.index = ['i1','i2','i3','i4','i5']
df.columns = ['A','B','C','D','E']

In [6]:
df

     A   B   C   D   E
i1  45   5   7  35  31
i2  19  44  33  47  30
i3  32  25  26  46  33
i4  45  45   1  21  49
i5  47   5  28   8  30

In [7]:
data = pd.DataFrame([[120,45],[54,66]], columns=['Intake','Admitted'],index=['Mech','IT'])
data

      Intake  Admitted
Mech     120        45
IT        54        66

In [9]:
students = pd.DataFrame({'Rollno':[1,2,3],'Names':['A','B','C'],'Marks':[67,54,88]})
students

   Rollno Names  Marks
0       1     A     67
1       2     B     54
2       3     C     88

In [10]:
df1 = pd.DataFrame(np.random.randint(1,50,25).reshape(5,5))
df1

    0   1   2   3   4
0  26  14   1   6  36
1  16   1  18  10  31
2  38   6  13  33  32
3  44  38  21  29  29
4  26  11  38  29  24

In [11]:
df

     A   B   C   D   E
i1  45   5   7  35  31
i2  19  44  33  47  30
i3  32  25  26  46  33
i4  45  45   1  21  49
i5  47   5  28   8  30

### slicing Indexing

In [20]:
df['D']   # fetch column in the form of series

i1    35
i2    47
i3    46
i4    21
i5     8
Name: D, dtype: int32

In [19]:
df.loc['i1']   # fetch row in the form of series

A    45
B     5
C     7
D    35
E    31
Name: i1, dtype: int32

In [21]:
data

      Intake  Admitted
Mech     120        45
IT        54        66

In [23]:
data['remaining']=[8,0]     # add new column
data

      Intake  Admitted  remaining
Mech     120        45          8
IT        54        66          0

In [25]:
data['calculate remaining']=data['Intake'] - data['Admitted']   # calculate data 
data

      Intake  Admitted  remaining  calculate remaining
Mech     120        45          8                   75
IT        54        66          0                  -12